
## Plan Result




<pre><code>Plan: 3 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.pre_api.azurerm_api_management_api.api
  * module.pre_api.azurerm_api_management_product_api.link_to_product[0]
  * module.pre_product.azurerm_api_management_product.product
* Update
  * azurerm_key_vault_secret.API_POSTGRES_PASS
  * azurerm_key_vault_secret.POSTGRES_PASS


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.API_POSTGRES_PASS will be updated in-place
  ~ resource "azurerm_key_vault_secret" "API_POSTGRES_PASS" {
        id                      = "https://pre-stg.vault.azure.net/secrets/api-POSTGRES-PASS/6324c8f675fe453b975f1ab2e8eda2dd"
        name                    = "api-POSTGRES-PASS"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_PASS will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_PASS" {
        id                      = "https://pre-stg.vault.azure.net/secrets/postgresdb-password/5c0d74ee92434f359af4a44f9b9bf668"
        name                    = "postgresdb-password"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.pre_api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "sds-api-mgmt-stg"
      + api_type              = "http"
      + display_name          = "Pre Recorded Evidence"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "pre-api"
      + path                  = "pre-api"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "ss-stg-network-rg"
      + revision              = "1"
      + service_url           = "http://pre-api-stg.service.core-compute-stg.internal"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi+json-link"
          + content_value  = "http://pre-api-stg.service.core-compute-stg.internal/v3/api-docs"
        }
    }

  # module.pre_api.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pre-api"
      + id                  = (known after apply)
      + product_id          = "pre"
      + resource_group_name = "ss-stg-network-rg"
    }

  # module.pre_product.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "sds-api-mgmt-stg"
      + approval_required     = false
      + display_name          = "pre"
      + id                    = (known after apply)
      + product_id            = "pre"
      + published             = true
      + resource_group_name   = "ss-stg-network-rg"
      + subscription_required = false
      + subscriptions_limit   = 20
    }

Plan: 3 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":660,"Program":"tfcmt","SHA1":"","Vars":{}} -->